
    #1

# Створіть клас Soda (для визначення типу газованої води), що приймає 1 аргумент при ініціалізації (що відповідає за
# добавку до лимонаду, що вибирається). У цьому класі реалізуйте метод show_my_drink(), що виводить на друк «Газування
# та {ДОБАВКА}» у разі наявності добавки, а інакше з'явиться така фраза: «Звичайне газування».


# class Soda:
#     def __init__(self, gaz_n=""):
#         self.gaz = gaz_n
#
#     def show_my_drink(self):
#         if len(self.gaz) > 0:
#             return f'Газування та {self.gaz}'
#         else:
#             return "Звичайне газування"
#
#
# laim_cola = Soda("laim")
# cola = Soda()
#
# print(laim_cola.show_my_drink())
# print(cola.show_my_drink())




    #2

# Микола – оригінальна людина. Він вирішив створити клас Nikola, який приймає при ініціалізації 2 параметри: ім'я та вік.
# Але на цьому він не заспокоївся. Не важливо, яке ім'я передасть користувач під час створення екземпляра, воно завжди
# міститиме “Миколая”. Зокрема – якщо користувача насправді звуть Миколою, то з ім'ям нічого не станеться, а якщо його звуть,
# наприклад, Максим, то воно перетворюється на “Я не Максим, а Микола”.


# class Nikola:
#     def __init__(self, name_par, age_par):
#         if name_par == "Микола":
#             self.name = name_par
#         else:
#             self.name = f'Я не {name_par}, а Микола'
#         self.age = age_par
#
#     def __str__(self):
#         return f'{self.name}. {self.age} років'
#
#
# valentin = Nikola("Valentin", "28")
# print(valentin)
#
# valentin2 = Nikola("Микола", "28")
# print(valentin2)