        # 1

# n = input("Введіть число\n")                #Вводимо число "n" (по замовчуванні це строка)
# sumN = int(n) + int(n*2) + int(n*3)         #Робимо перемноження строки "n" та змінюємо його тип на "int"
# print(sumN)                                 #Виводимо результат


        # 2

# x = [print(x) for x in range(int(input("num 1\n"))+1, int(input('num 2\n'))) if not x % 2]        #Використовуємо принцип розуміння списка,
                                            #одразу з нього виводимо всі числа у діапазоні від "num 1" до "num 2" приумові, що вони парні,
                                            #Для того щоб при парному "num 1" нам його не виводило ми до нього додаємо 1.
