#gamer = [2, 1, 5]
#spider = [5, 0, 2]
#import random

def battle_1():
    spider = [5, 0, 5]
    gamer[0] = gamer[0] + gamer[1]
    print("Ви бачите перед собою ворога, що ж почнемо бій\n")
    while gamer[0] >= 0 or spider[0] >= 0:
        z = input("Натисніть 'ENTER' для удара")
        print()
        you_attak = random.randrange(0, gamer[2], 1)
        spider_attak = random.randrange(0, spider[2], 1)
        gamer[0] = gamer[0] - spider_attak
        spider[0] = spider[0] - you_attak
        print("Ви нанесли павуку", you_attak, "пошкоджень. У нього залишилось", spider[0], "HP")
        print("Павук вкусив у відповідь на", spider_attak, "У вас залишилось", gamer[0], "HP")
        print()
        if gamer[0] <= 0 or spider[0] <= 0:
            break
    if gamer[0] > 10:
        gamer[0] = 10
    elif gamer[0] < 0:
        print("Ну що ж, ви не змогли подужати павучка, тому відправляєтесь до предків, а вони ж попереджали...")
    if gamer[0] > 0:
        print("Ну щож, хоч це було і не легко, але ви перемогли")
        print("Ваші характеристики: \n", "Здоров'я.....", gamer[0], "Броня.....", gamer[1], "Атака.....", gamer[2])
        print()
    
    return gamer
#battle_1()
#print(gamer)


#gamer = [2, 1, 5]
#import random

def battle_2():
    guard = [5, 10, 3]
    gamer[0] = gamer[0] + gamer[1]
    guard[0] = guard[0] + guard[1]
    print("Ви бачите перед собою Стража-скелета, на відміну від павука закованого у броню, що ж нанесемо удар")
    while gamer[0] >= 0 or guard[0] >= 0:
        z = input("Натисніть 'ENTER' для удара\n")
        you_attak = random.randrange(0, gamer[2], 1)
        guard_attak = random.randrange(0, guard[2], 1)
        gamer[0] = gamer[0] - guard_attak
        guard[0] = guard[0] - you_attak
        print("Ви нанесли Стражу", you_attak, "пошкоджень. У нього залишилось", guard[0], "HP")
        print("Страж вдарив у відповідь на", guard_attak, "У вас залишилось", gamer[0], "HP")
        print()
        if gamer[0] <= 0 or guard[0] <= 0:
            break
    if gamer[0] > 10:
        gamer[0] = 10
    elif gamer[0] < 0:
        print("Ну що ж, ви не змогли подужати Стража, тому відправляєтесь до предків, а вони ж попереджали...")
    if gamer[0] > 0:
        print("Ну щож, хоч це було і не легко, але ви перемогли")
        print("Ваші характеристики: \n", "Здоров'я.....", gamer[0], "Броня.....", gamer[1], "Атака.....", gamer[2])
        print()
    
    return gamer
#battle_2()
#print(gamer)


def room_1():
    print("Ви увійшли до кімнати. У сполохах факелу вдалині видко прохід, проте щось моторшно вам у цій печері.")
    print("Що ж робити? Відступити перед первісними інстинктами чи йти далі?")
    diya = input("[вперед] [до мами]\n")
    if diya == "вперед":
        print("Після першого кроку ви зрозуміли, що шепіт предків, що ви сприйняли за свавілля первісних інстинктів, попереджав вас не дарма. на зустріч вам вистрибнув павук небачених розмірів. Ну що ж, готуймрсь до бою")
        battle_1()
    else:  
        print("Ви не змогли приборкати свої інстинкти та втекли під мамину спідницю. Ну що ж, знайдуться інші герої, які дійдуть до кінця")     
        print()
        print("Проте, не щастить і слабакам. Порив вітру вдарив у плечі та штовхнув вас вперед. О ні)")
        print()
        print("Після першого кроку ви зрозуміли, що шепіт предків, що ви сприйняли за свавілля первісних інстинктів, попереджав вас не дарма. на зустріч вам вистрибнув павук небачених розмірів. Ну що ж, готуймрсь до бою")

        battle_1()
    
    return gamer
    return diya


def room_0():
    print("Перед вами залишки зброярні, чи є у вас бажання залізти у ці груди трухлявих стійок та шаф?")
    diya = input("[так], [ні]\n")
    if diya == "так":
        lut = random.randrange(0, 2, 1)
        if lut == 0:
            print()
            print("На жаль зрадлива пані Вдача не на вашому боці і. окрім трухи та пилюки тут нічого немає")
            print()
        else:
            print()
            print("Пані Вдача вам посміхнулась, серед трухи та пилюки ви помітили блиск дорогоцінного каменю у ефесі хорошого меча, з ним ваша атака збільшеється на +2")
            gamer[2] += 2
            print("Ваші характеристики: \n", "Здоров'я.....", gamer[0], "Броня.....", gamer[1], "Атака.....", gamer[2])
            print()
    else:
        print("Ну що ж, може й дійсно не пристало Герою порпатись у смітті.")
        print()
    return gamer


def room_2():
    #gamer = [10, 10, 5]
    #import random
    print("Перед вами коридор, з гарною плиткою на пілозі у 2 ряди в ширину та у 5 рядів вперед. Проте, обпечені кислотою тіла павуків вказують, що підлога не є безпечною, проте пройти її можна, якщо ставати на правильні плитки. крізь пил видно, що плитки пронумеровані з ліва на право [1] та [2]. тому йдемо вперед і наступаємо на одну з них")
    for i in range(5):        
        acid = random.randrange(1, 3, 1)
        steep = int(input("На яку плитку станемо далі? [1] [2]\n"))
        if steep == acid:
            gamer[0] -= 2
            gamer[1] -= 1
            print("Плитка просідає, і кислота з під неї проникає вам у черевики, забираючи 2 одиниці здоров'я та 1 броні")
            print("Ваші харатеристики: \n", "Здоров'я.....", gamer[0], "Броня.....", gamer[1], "Атака.....", gamer[2])
            print()
        else:
            print("Схоже, що на цей раз ви зробили правильний крок")
            print()
    if gamer[0] > 0:
        print("Це було нелегко, проте ви дійшли до кінця")
        print("Ваші характеристики: \n", "Здоров'я.....", gamer[0], "Броня.....", gamer[1], "Атака.....", gamer[2])
        print()
    else:
        print("Знову ж таки виявилось, що вдача та логіка не на вашому боці, ну що ж лети у небо")
    return gamer
#room_2()


gamer = [10, 5, 5]
import random
print("Перед вами вхід у Агларонд також відомий як Сяючі печери Агларонда- природне печерне городище під горами у Хельмовій Ущелині у Еред Німраіс")
diya = input("Бажаєте увійти до нього?\n [так], [ні]\n")
if diya == "ні":
    print("Значить ви недостойні звання героя, повертайтесь додому. Доля знайде нового обранця.")
else:
    room_0()
    diya = input("Перед вами два, на перший погляд схожих проходи. Проте придивившись ви помічаєте, що на правому сліди павутини та сміття, тоді як на лівому, більш чистому проступають якісь малюнки. Який же шлях обере Герой?\n [правий] [лівий]\n")
    if diya == "правий":
        room_1()
        if gamer[0] > 0:
            print("Ви вийшли у велику залу, оздоблення якої одрразу каже, що ви на місці, ось вона - скарбниця")
            battle_2()
            if gamer[0] > 0:
                print("Тепер ви багаті, та вкриті славою (навпіл з кров'ю). Як будетее повертатись? Протореним шляхом, чи спробуєте нову дорогу та нові пригоди? Оно і ще одні двері видніються")
                diya = input("[назад] [вперед]\n")
                if diya == "назад":
                    print("Ви вийшли у зброярню ледве живий, проте багатий. І хоч ви здогадуєтесь, що ці скарби можуть легко розтектись з блек-джеком та ..., проте ви знаєте, як вони здобуваються")
                    print("The END")
                else:
                    room_2()
                    if gamer[0] > 0:
                        print("Ви вийшли у зброярню ледве живий, проте багатий. І хоч ви здогадуєтесь, що ці скарби можуть легко розтектись з блек-джеком та ..., проте ви знаєте, як вони здобуваються")
                        print("The END")
    else:
        room_2()
        if gamer[0] > 0:
            print("Ви вийшли у велику залу, оздоблення якої одрразу каже, що ви на місці, ось вона - скарбниця")
            battle_2()
            if gamer[0] > 0:
                print("Тепер ви багаті, та вкриті славою (навпіл з кров'ю). Як будетее повертатись? Протореним шляхом, чи спробуєте нову дорогу та нові пригоди? Оно і ще одні двері видніються")
                diya = input("[назад] [вперед]\n")
                if diya == "назад":
                    room_2()
                    if gamer[0] > 0:
                        print("Ви вийшли у зброярню ледве живий, проте багатий. І хоч ви здогадуєтесь, що ці скарби можуть легко розтектись з блек-джеком та ..., проте ви знаєте, як вони здобуваються")
                        print("The END")
                else:
                    room_1()
                    if gamer[0] > 0:
                        print("Ви вийшли у зброярню ледве живий, проте багатий. І хоч ви здогадуєтесь, що ці скарби можуть легко розтектись з блек-джеком та ..., проте ви знаєте, як вони здобуваються")
                        print("The END")
                
